In [1]:
import pandas as pd

In [2]:
schools_file = '../Resources/schools_complete.csv'
students_file = '../Resources/students_complete.csv'

In [4]:
schools_df = pd.read_csv(schools_file)
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
students_df = pd.read_csv(students_file)
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
schools_df.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [7]:
schools_df.nunique()

School ID      15
school_name    15
type            2
size           15
budget         15
dtype: int64

In [9]:
total_schools = schools_df['School ID'].nunique()
total_schools

15

In [11]:
students_df.nunique()

Student ID       39170
student_name     32715
gender               2
grade                4
school_name         15
reading_score       37
math_score          45
dtype: int64

In [14]:
students_dups = students_df.loc[students_df['student_name'].duplicated()]
students_dups.head(15)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
280,280,Ashley Jones,F,9th,Huang High School,92,72
483,483,James Lopez,M,9th,Huang High School,68,89
826,826,David Miller,M,9th,Huang High School,83,85
864,864,Jennifer Fox,F,10th,Huang High School,76,93
917,917,Jordan Lewis,M,12th,Huang High School,98,80
919,919,Michael Brown,M,12th,Huang High School,88,98
954,954,David Hernandez,M,11th,Huang High School,70,77
1094,1094,Michael Lewis,M,11th,Huang High School,84,74
1271,1271,Christopher Green,M,10th,Huang High School,97,98
1355,1355,Cindy Williams,F,10th,Huang High School,77,72
1396,1396,Angela Brown,F,10th,Huang High School,95,61
1456,1456,Steven Houston,M,11th,Huang High School,99,70
1547,1547,Dawn Martinez,F,11th,Huang High School,67,66
1589,1589,Scott Stewart,M,11th,Huang High School,94,99
1600,1600,Matthew Williams,M,10th,Huang High School,84,85

In [15]:
students_dups.loc[students_dups['student_name'] == 'Ashley Jones']

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
280,280,Ashley Jones,F,9th,Huang High School,92,72
14122,14122,Ashley Jones,F,11th,Wilson High School,72,83
16096,16096,Ashley Jones,F,9th,Cabrera High School,95,80
19259,19259,Ashley Jones,F,11th,Bailey High School,72,89
34102,34102,Ashley Jones,F,11th,Johnson High School,78,55

In [16]:
students_df.shape

(39170, 7)

In [17]:
total_students = students_df['Student ID'].nunique()

In [18]:
total_students

39170

In [19]:
total_budget = schools_df['budget'].sum()
total_budget

24649428

In [20]:
avg_math_score = students_df['math_score'].mean()
avg_reading_score = students_df['reading_score'].mean()
print(avg_math_score)
print(avg_reading_score)

78.98537145774827
81.87784018381414

In [25]:
number_of_students_passing_math = students_df.loc[students_df['math_score']>=70]['Student ID'].nunique()
number_of_students_passing_math

29370

In [26]:
percent_students_passing_math = number_of_students_passing_math / total_students * 100
percent_students_passing_math

74.9808526933878

In [27]:
number_of_students_passing_reading = students_df.loc[students_df['reading_score']>=70]['Student ID'].nunique()
number_of_students_passing_reading

33610

In [28]:
percent_students_passing_reading = number_of_students_passing_reading / total_students * 100
percent_students_passing_reading

85.80546336482001

In [41]:
overall_passing_rate = (avg_math_score + avg_reading_score) / 2
overall_passing_rate

80.43160582078121

In [47]:
district_summary_df = pd.DataFrame({'Total Schools': [total_schools],
                                  'Total Students': f"{total_students:,}",
                                   'Total Budget': f"{total_budget:,}",
                                   'Average Math Score': [avg_math_score],
                                   'Average Reading Score': [avg_reading_score],
                                   '% Passing Math': [percent_students_passing_math],
                                   '% Passing Reading': [percent_students_passing_reading],
                                   'Overall Passing Rate': [overall_passing_rate]})
district_summary_df.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"39,170","24,649,428",78.985371,81.87784,74.980853,85.805463,80.431606